package com.uiktp.config.database;

import com.uiktp.model.Course;
import com.uiktp.model.Semester;
import com.uiktp.model.User;
import com.uiktp.model.UserRole;
import com.uiktp.repository.CourseRepository;
import com.uiktp.repository.SemesterRepository;
import com.uiktp.repository.UserRepository;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.CommandLineRunner;
import org.springframework.stereotype.Component;

import java.util.List;

@Component
public class DatabaseSeeder implements CommandLineRunner {

    @Autowired
    private UserRepository userRepository;

    @Autowired
    private SemesterRepository semesterRepository;

    @Autowired
    private CourseRepository courseRepository;

    @Override
    public void run(String... args) throws Exception {
        User student = new User("Example Student", "student@gmail.com", "student123", UserRole.USER, "211123");

        if (!userRepository.existsByEmail("student@gmail.com")){
            userRepository.save(student);
        }

        for (int i = 1; i <= 8; i++) {
            Semester semester = new Semester();
            semester.setName("Semester " + i);
            semester.setStudent(student);
            if (!semesterRepository.existsByName("Semester 1")) {
                semesterRepository.save(semester);
            }
        }

        List<Course> courses = List.of(
                new Course(null,
                "Бизнис и менаџмент",
                "Развој на менаџерски способности: техничка, концепциска, комуникациска, аналитичка. Усвојување на рамки, поими, модели и техники од областа на менаџментот. Презентирање и анализа на примери, студии на случај и најдобри менаџмент практики од повеќе бизнис области и студии на случај на поодделни бизниси.",
                null),
                new Course(null,
                "Вовед во компјутерските науки",
                "Солидно познавање на основите на информатичко-комуникациските технологии, нивното создавање, моментална состојба и иднината; начинот на кој функционираат сметачите, основите на Веб, обработката на сликите, видеото и анимациите; клучните области на информациско-комуникациските технологии и нивното влијание: способност за манипулација со текст, табели, графикони, слики, аудио и видео.",
                null),
                new Course(null,
                "Калкулус",
                "Предметот е од подршка и е неопходен за воведување на поимите за функција, лимес, извод и интеграли кои се неопходни во скоро сите предмети од повисоки години.",
                null),
                new Course(null,
                "Професионални вештини",
                "Целта на курсот е да студентите да се стекнат со вештини потребни за академско и техничко пишување и презентирање, со водење сметка за етиката и критичкото мислење. По завршување на курсот се очекува студентот да може да изработи квалитетни академски текстови (пасус, есеј, CV, формално писмо) на англиски и македонски јазик; да разликува помеѓу различни технички текстови (спецификација, елаборат, извештај, техничка документација) и да идентификува нивни делови; да одржи 15-минутна ефективна презентација на зададена тема на англиски јазик и да одговори на прашања поврзани со презентацијата",
                null),
                new Course(null,
                "Структурно програмирање",
                "Да се воведат студентите во парадигмата на структурното програмирање, да го разберат концептот на алгоритми и да се оспособат да развиваат алгоритми, да кодират, тестираат и компајлираат програми. Ќе бидат воведени податочните типови, контролните структури,функциите, полињата, датотеките.",
                null),
                new Course(null,
                "Архитектура и организација на компјутери",
                "Разбирање на главните компјутерски архитектури, внатрешната организација,проценка на перформансите на поедините делови и компјутерскиот систем во целинa.",
                null),
                new Course(null,
                "Дискретна математика",
                "Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од информациски технологии, компјутерско и софтверско инженерство.",
                null),
                new Course(null,
                "Објектно ориентирана анализа и дизајн",
                "Запознавање со техниките за анализа, дизајн и моделирање на објектно ориентираните системи. Оспособување за практична анализа на кориснички барања и креирање ефективни ОО модели како почетна фаза на имплементацијата на ОО системот.",
                null),
                new Course(null,
                "Објектно-ориентирано програмирање",
                "Целта на предметот е да го запознае студентот со основните концепти на објектно-ориентираното програмирање. За таа цел ќе бидат воведени концептите на објекти и класи, eнкапсулација, наследување и полиморфизам. Студентите ќе бидат запознаени и со хиерахијата на класи. Ќе се направат споредби на имплементациите на објектно-ориентираните концепти во различни програмски јазици. По завршување на курсот студентот ќе ги разбира принципите на објектно-ориентираното програмирање и биде оспособен за развој на програми кои ги подржуваат овие принципи.",
                null),
                new Course(null,
                "Калкулус 2",
                "Предметот е од подршка и е неопходен за воведување на поимите за интеграли, примена на интерграли, низи и редови кои се неопходни во дел од предметите од повисоки години.",
                null),
                new Course(null,
                "Компјутерски компоненти",
                "Познавање на структурата на компјутерските системи, хардверските компоненти, поврзувањето и начинот на работа, карактеристиките и стандардите што се употребуваат.",
                null),
                new Course(null,
                "Креативни вештини за решавање проблеми",
                "Студентот ќе се здобие со способност за критичко размислување и развој на вештините на размислување надвор од стандардните норми и принципи. Ќе биде во можност да го постави проблемот во рамка и да го изложи правилно, како и да решава неструктурирани проблеми. Ќе има подобрени вештини за општо решавање на проблеми од различен карактер кои стимулираат логичко размислување.",
                null),
                new Course(null,
                "Маркетинг",
                "Вовед во главните елементи за развој на маркетинг стратегија и планирање на програма за маркетинг; Развој на вештини за решавање на маркетинг проблеми преку аналитички алатки (рамки, поими, модели и техники); Анализа на примери и студии на случај како претпријатијата го организираат својот маркетинг, со акцент на ИКТ претпријатија; Подобрување на комуникациските вештини, усни и писмени, работа во тим при изработка на проектна задача, презентирање на проектната задача.",
                null),
                new Course(null,
                "Основи на веб дизајн",
                "По комплетирање на курсот кандидатите се очекува студентите да добијат воведни знаењаза развој на веб страници со современ дизајн, употреба на ХТМЛ и каскадни стилови. Се очекува кандидатите да: 1. Демонстрираат основно разбирање на важноста на добар дизајн на веб страниците. 2. Демонстрираат практично знаење за технологиите за веб дизајн и да можат да го применат знаењето при основно дизајнирање на веб сајтови. 3. Да комуницираат со терминологија специфична за оваа област. 4. Критички да евалуираат примери на веб сајтови.",
                null),
                new Course(null,
                "Основи на сајбер безбедноста",
                "Студентот ќе се запознае со концептот на сајбер безбедност, закани и ризици. Ќе биде свесен за проблемите предизвикани од сајбер криминалот и ќе биде во можност да ги разбира ризиците од напади и основните механизми како да се заштити од нив.",
                null),
                new Course(null,
                "Алгоритми и податочни структури",
                "Запознавање со основните податочни структури и алгоритми кои се понатаму неопходни за работа со бази на податоци како и за други апликации. Студентот ќе биде оспособен за користење и развој на структури и алгоритми со линеарни листи, стебла, графови како и и индекси за пребарување. Исто така ќе биде оспособен за Имплементација на различните архетипи на  алгоритми што се користат во практичната имплементација на многу софтверски решенија.",
                null),
                new Course(null,
                "Веројатност и статистика",
                "Да се воведат основните концепти од веројатност и статистичка анализа со дискусија на примените во компјутерските науки. Да се оспособат студентите за успешно следење на стручните предмети во кои се применуваат елементи од теорија на веројатност и статистика.",
                null),
                new Course(null,
                "Компјутерски мрежи и безбедност",
                "Вовед во основните концепти на компјутерските мрежи и безбедноста. Студентот ќе се здобие со знаења поврзани со мрежната архитектура, мрежните протоколи и работата на мрежите, како и главните поими од мрежната безбедност. Студентот ќе се запознае со главните компоненти и апликации на TCP/IP свитата од протоколи.",
                null),
                new Course(null,
                "Економија за ИКТ инженери",
                "ИКТ инженерите, изработувајќи и нудејќи ИКТ услуги, се соочуваат со прашања\n" +
                        "во врска со SLA договорите, продавачите, добавувачите, со финансиските аспекти\n" +
                        "на ИКТ услугите – колку чини услугата, зошто токму толку, колкави се\n" +
                        "трошоците, колку е дозволено да бидат трошоците и слично. Области кои им е\n" +
                        "потребно да ги владеат се буџетирање, книговодство, определување на цени,\n" +
                        "финансиско планирање, финансиска анализа и известување. Овој курс има за\n" +
                        "задача да им овозможи да ги совладаат овие области преку опис на основните\n" +
                        "економски модели; демонстрирање како овие модели работат; опис на главните\n" +
                        "економски феномени со користење економски модели.",
                null),
                new Course(null,
                "Инженерска математика",
                "Предметот опфаќа методи за нумеричкото решавање на повеќе математички проблеми, како и примена на некои позначајни математички трансформации во инженерството.",
                null),
                new Course(null,
                "Интернет програмирање на клиентска страна",
                "Целта на курсот е да овозможи запознавање на студентите со основните на програмирањето на интернет клиентската страна. Во таа насока студентите ќе бидат запознаени со дел од програмските јазици и технологиите за пишување програми што се извршуваат на клиентската страна. По завршување на курсот се очекува студентот да може да развива интерактивни веб-страници со користење на програмски јазици наменети за програмирање на клиентската страна.",
                null),
                new Course(null,
                "Напредно програмирање",
                "Да се воведат студентите во парадигмата на генеричкото програмирање. Да се запознаат со апстрактни податочни типови, креирање на темплејт класи и функции. Да развијат вештини за употреба на колекции на податоци (вектори, редови, листи, множества и речници). На крај се очекува студентите да можат да ги аплицираат концептите на шаблони за објектно- ориентиран развој на софтвер при моделирање на некој специфициран проблем во робусна објектно-ориентирана програма. Студентите ќе бидат запознаени со техниките за развивање на софтвер во интегрирана развојна околина.",
                null),
                new Course(null,
                "Управување со техничката поддршка",
                "По завршувањето на курсот се очекува студентот да ги разбира методите и системите за решавање на ИТ проблемите преку обезбедување на квалитетна техничка поддршка.",
                null),
                new Course(null,
                "Шаблони за дизајн на кориснички интерфејси",
                "Целта на предметот е да ги запознае студентите со основните проблеми и начини на решавање на истите за различните видови кориснички интерфејси и корисничка интеракција. По завршување на курсот се очекува студентот да демонстрира познавање на основните видови корисничка интеракција и принципите за нивно дизајнирање, и да може самостојно да развива интерактивни апликации со користење на програмски алатки следејќи ги научените принципи.",
                null),
                new Course(null,
                "Анализа на софтверските барања",
                "По завршувањето на предметот се очекува студентот да ги разбира и има\n" +
                        "продлабочено знаење во примена на техниките за извлекување знаење од\n" +
                        "клиентот, да ги разбира техниките за документирање на софтверски и бизнис\n" +
                        "потреби, да ги разбира и има продлабочено знаење во примената на техники за\n" +
                        "управување со промени кај софтверски и бизнис барања.",
                null),
                new Course(null,
                "Оперативни системи",
                "Студентот ќе биде воведен во основните градбени блокови на модерните оперативни системи преку нивна конкретна реализација во Windows и UNIX-like системите.",
                null),
                new Course(null,
                "Безжични и мобилни системи",
                "Познавање и разбирање на системите за безжична и мобилна комуникација",
                null),
                new Course(null,
                "Вештачка интелигенција",
                "Успешниот студент ќе има продлабочени познавања од основните области на вештачката интелигенција, вклучувајќи ги: пребарувањето, решавањето проблеми, претставувањето на знаењето, расудувањето, донесувањето одлуки, планирањето и учењето и нивната примена. Исто така, ќе биде во состојба да ги дизајнира и реализира клучните проблеми од интелигентните системи со средна сложеност и да го процени нивното однесување.",
                null),
                new Course(null,
                "Визуелно програмирање",
                "Со завршување на овој курс се очекува студентите да се запознаени со техниките за развивање на софтвер во напредна интегрирана развојна околина користејќи модерен објектно-ориентиран програмски јазик, дизајнирање на богати графички кориснички интерфејси и откривање и отстранување на грешки во истата.Се очекува студентите да бидат оспособени за развој на настански водени апликации, развој на графички кориснички интерфејси, напредни форми за внесување на податоци, кориснички дефинирани контроли и креирање на инсталациски пакети.",
                null),
                new Course(null,
                "Вовед во екоинформатиката",
                "Екоинформатиката е наука за информации (информатика) во екологијата и науката за животната средина. Ги интегрира еколошките и информатичките науки за да ги дефинира ентитетите и природните процеси со јазик заеднички за луѓето и за компјутерите.",
                null),
                new Course(null,
                "Вовед во случајни процеси",
                "Да се оспособат студентите да моделираат случајни процеси за реални ситуации.",
                null),
                new Course(null,
                "Дигитално процесирање на слика",
                "По завршување на курсот се очекува студентот да ги владее и користи основните\n" +
                        "алатки и методи за обработка на слики.",
                null),
                new Course(null,
                "Дизајн на алгоритми",
                "Во овој курс ќе се научат повеќе алгоритми и методи за решавање на проблемите со компјутер, како и одредени структури на податоци за имплементација на истите. Студентот ќе стекне искуство од програмирање, ќе ги разбере принципите на дизајнирање на алгоритми, анализа на перформансите на алгоритмите и ќе ги научи фундаменталните идеи за дизајн на ефикасен алгоритам и комбинирање на истиот со соодветна структура на податоци. Идеите ќе се применат во пракса преку лабораториск вежби.",
                null),
                new Course(null,
                "Е-влада",
                "Целта на курсот е студентите да се запознаат со испораката на услугите од страна на владините институции кон корисниците: граѓаните, бизнисите и организациите од невладиниот сектор и примената на информациските технологии во тие процеси; да се запознаат со напредните држави и напредните области на примена на е-влада преку анализа на примери, студии на случај и најдобри практики; Подобрување на комуникациските вештини, усни и писмени, работа во тим при изработка на проектна задача, презентирање на проектната задача.",
                null),
                new Course(null,
                "Електрични кола",
                "Запознавање со основните поими и појави од електричните кола, со основните закони и теореми во теоријата на електричните кола и со некои методи за анализа на електрични мрежи со временски констатни и временски прпоменливи струи и напони. Користење на основните законитости во електротехниката при решавање на конкретни проблеми во инженерството.",
                null),
                new Course(null,
                "Интернет технологии",
                "Познавање на механизмите кај HTTP протоколот. Запознавање со платформи за развој на интернет апликации. Креирање и развој на веб апликции. Креирање и користење на веб сервиси.",
                null),
                new Course(null,
                "Компјутерска графика",
                "Целта на предметот е запознавање на студентите со теориските основи и концепти на 2D и 3D компјутерска графика, геометриското моделирање, трансформациите, рендерирањето и генерирањето криви и површини со помош на сплајнови. Практичната имплементација на алгоритмите ќе се реализира со помош на OPEN GL. По завршување на курсот се очекува студентот да демонстрира познавање на теориските основи и концепти на 2Д и 3Д компјутерската графика, да користи OpenGL библиотека и графички софтверски пакети за практична реализација на проблеми од компјутерската графика.",
                null),
                new Course(null,
                "Концепти на информатичко општество",
                "Целта на курсот е да се запознаат студентите со теориите и пристапите кои ја\n" +
                        "анализираат улогата на информатичката технологија, медиумите и знаењето во\n" +
                        "модерното општество. По завршување на модулот студентите треба да бидат\n" +
                        "способни да: 1. Систематски и критично дискутираат, евалуираат и ги анализираат\n" +
                        "главните теми, принципи, концепти и теории на информатичкото општество 2.\n" +
                        "Применуваат различни концепти од информатичкото општество 3. Покажат\n" +
                        "разбирање за важноста на информатичката технологја и знаењето во модерното\n" +
                        "општество",
                null),
                new Course(null,
                "Медиуми и комуникации",
                "По завршувањето на предметот се очекува студентот да ги разбира основните поими од комуникатологијата како наука, како и да има продлабочено знаење во примена на постоечките техники и сознанија за подобрување за комуникацијата помеѓу чинителите на комуникацијата. Посебен осврт ќе биден даден на комуникацијата преку новите медиуми и начинот на кој новите медиуми влијаат во различни општествени сфери. Студентите ќе бидат запознаени со основните принципи за испитување на јавно мислење и користење на новите медиуми (со посебен фокус на социјалните мрежи) за градење и промовирање на бренд (личен или корпоративен).",
                null),
                new Course(null,
                "Теорија на информации со дигитални комуникации",
                "Студентите ќе бидат запознаени со квантитативната теорија на информации и\n" +
                        "нејзината примена во надежни и ефикасни комуникациски системи. Дополнително ќе\n" +
                        "бидат запознаени со математичкиот модел на комунникацискиот систем.",
                null),
                new Course(null,
                "Бази на податоци",
                "Запознавање на студентот со основните концепти за работа со бази на податоци, начините на нивно моделирање и имплементирање, како и работа со прашалните јазици. Студентот ќе биде способен да моделира бази на податоци преку семантичко и релациско моделирање и процес на нормализација, ќе знае практично да го применува SQL стандардот за креирање, одржување и манипулација на релациските бази на податоци. Студентот ќе има познавање за основните концепти на конкурентно работење и трансакции.",
                null),
                new Course(null,
                "Вовед во науката за податоци",
                "Запознавање со основите за науката базирана на податоци. Студентите ќе се запознаат со процесот и методологијата при работа со податоци, почнувајќи од идентификацијата на проблемите, преку собирање на податоци, а потоа и нивна обработка. Студентите ќе ги научат основните техники за обработка на податоците и идентификување на шаблони во нив, како и начините на визуелизација и интерпретација на добиените резултати.",
                null),
                new Course(null,
                "Дизајн и архитектура на софтвер",
                "Целта на курсот е студентите да ги научат главните концепти на објектно\n" +
                        "ориентирана анализа и дизајн. Да се запознаат со техниките на рефакторирање,\n" +
                        "шаблоните за дизајн и различните архитектури на софтвер. По завршувањето на\n" +
                        "курсот кандидатите ќе можат да ги идентификуваат ограничувањата и проценат\n" +
                        "квалитетите на софтверските системи. За конкретна софтверска спецификација ќе\n" +
                        "можат да ја проценат нејзината комплетност и конзистентност, како и да\n" +
                        "дизајнираат софтверска архитектура во согласност со дадените барања.",
                null),
                new Course(null,
                "Администрација на системи",
                "Системската администрација претставува комплексен процес на оперативно управување со системските и софтверските компоненти кај компјутерските системи, се со цел да се обезбеди безбедни, надежни и достапни сервиси и услуги на корисниците. Организацијата на процесот на системска администрација е повеќестран и вклучува активности поврзани со управување со оперативни системи, мрежни сервиси како и на апликативни и други серверски системи.",
                null),
                new Course(null,
                "Веб програмирање",
                "Развој на веб комплетни веб апликации со користење на MVC шаблонот за развој. Студентите ќе научат да развиваат веб апликации и веб сервиси, да се поврзуваат и да користат бази на податоци. Да развиваат безбедносни механизми кај веб апликациите и да тестираат веб апликации",
                null),
                new Course(null,
                "Визуелизација",
                "Предметот треба да овозможи запознавање на студентите со концептот на вузуелизација на податоци, избор на техники и алгоритми за визуелизација на различни податочни множества, и нивна програмска реализација. По завршување на курсот се очекува студентот да демонстрира познавање на концептот на визуелизација на податоци, да знае да избере и да реализира алгоритми за визуелизација на различни видови податоци програмски и со користење на алатки за визуелизација",
                null),
                new Course(null,
                "Информациска безбедност",
                "Изучување на поими поврзани со информациската безбедност; постапки и механизми за заштита кај компјутерските системи од безбедносен аспект; методи што се применуваат за подигање на нивото на безбедност во однос на неовластен пристап.",
                null),
                new Course(null,
                "Компјутерска етика",
                "Способност да се согледаат клучните културни, општествени, правни и етички аспекти на ИКТ, влијанието на ИКТ, значењето и професионалните одговорности на ИКТ професионалците; Способност критички да се согледаат и дискутираат потенцијалните ризици што со себе ги носи ИКТ, вклучувајќи ги и последиците од нејзиниот развој врз развојот на човештвото; Стекнување информации за националните и меѓународните закони за спречување и заштита од компјутерскиот криминал.",
                null),
                new Course(null,
                "Компјутерски звук, говор и музика",
                "Да се стекнат со знаење на клучни прашања поврзани со анализата и генерирањето на звуци, говор и музика.",
                null),
                new Course(null,
                "Линеарна алгебра и примени",
                "Запознавање со концептите и методите на линеарната алгебра и како истите да се користат за рамислување и решавање на проблеми кои произлегуваат од компјутерските науки",
                null),
                new Course(null,
                "Мултимедиски мрежи",
                "Целите на предметот се да ги запознае студентите со карактеристиките на мултимедиските содржини кои се важни за далечински пренос, механизмите за дистрибуција на мултимедиски содржини од гледна точка на мрежните протоколи, пречките во мрежите при пренос, како и начините како да се подобори квалитетот на достава. Исто така, студентите ќе се запонзаат со различни платформи и архитектури за достава на мултимедиски содржини. Студентите ќе се оспособат да ги анализираат мулитмедиските содржини, да ги прилагодат и постават на сервери кои ќе обезбедат нивна достава во различни мрежни услови.",
                null),
                new Course(null,
                "Напреден веб дизајн",
                "Целта на наставната програма е студентите да се запознаат со напредните технологии во областа на веб дизајнот и развојот на модерни динамички веб апликации. По завршување на предметот, студентите ќе имаат преглед на најновите технички достигнувања во областа на веб дизајнот и ќе бидат способни да ги користат истите во изработк на практични проекти",
                null),
                 new Course(null,
                "Основи на роботиката",
                "По завршувањето на овој предмет, студентот се очекува да има познавања од принципите на развој на роботи и системи кои вклучуваат сензори и ефектори. Студентите ќе се запознаат со начините на програмирање роботи кои овозможуваат нивно управување. Студентите ќе се запознаат со примената роботите во индустријата и општеството",
                null),
                new Course(null,
                "Дизајн на интеракцијата човек-компјутер",
                "Целта на предметот е да ги запознае студентите со основните принципи за дизајнирање на компјутерски системи што вклучуваат интеракција човек-компјутер. За таа цел студентите ќе бидат запознаени со процесот на дизајнирање на интерактивни системи, фазите за дизајнирање (собирање и анализа на барања, креирање на прототипови, имлементација и тестирање на употребливост). По завршување на курсот се очекува студентот да демонстрира познавање на процесот и чекорите за дизајнирање на системи што вклучуваат интеракција човек-компјутер и да може да самостојно или во тим да реализира едноставен проект за дизајнирање на интерактивни системи.",
                null),
                new Course(null,
                "Интегрирани системи",
                "По завршување на курсот се очекува студентите да се оспособени за дизајн,\n" +
                        "избор, имплементација и менаџмент на ентерпрајз IT решенија. Да бидат\n" +
                        "способни за работа во корпоративна средина при имплементација и одржување\n" +
                        "со надградба на ентерпрајз IT решенија. Да бидат способни да развиваат\n" +
                        "стратегии за технолошки архитектури на комплексни софтверски системи кои\n" +
                        "опслужуваат обемни податоци, многу корисници и широк спектар деловно\n" +
                        "процеси.",
                null),
                new Course(null,
                "Софтверски квалитет и тестирање",
                "Целата на курсот е запознавање на студентие со потребата од тестирање на софтвер, различните техники на моделирање на софтверот и искористување на тие модели за тестирање, како и практични работа на тестирање, валидација и верификација на софтвер",
                null),
                new Course(null,
                "Агентно-базирани системи",
                "Агентно-базираното моделирање нуди природна метафора за разбирање и објаснување на многу феномени од доменот на биолошки и социјални системи – од еволуција и ширење на епидемии до сегрегација и формирање на коалиции. Многу системи може да се моделираат како средини составени од автономни агенти кои може да комуницираат, соработуваат, преговараат, да се спротивставуваат, да се водат од сопствени интереси или делуваат алтруистички. Микро-однесувањето на агенти водени од едноставни правила може да предизвика нови квалитети и комплексни појави во макро размери. Целта на предметот е запознавање на студентот со агентската парадигма за репрезентација и моделирање на системи од различни домени (пр. игри, роботи, однесување на социјални групи). По завршување на курсот се очекува студентот да има способност да дизајнира, моделира и реализира едно-агентен или повеќе-агентен систем користејќи соодветни алатки и платформи за развој.",
                null),
                new Course(null,
                "Безжични мултимедиски системи",
                "Разбирање на проблемите кои се јавуваат при пренос на мултимедија во безжични и мобилни мрежи. Познавање на концептите од областа на дизајн, анализа и имплементација на безжични и мобилни мултимедиски системи. Познавање на техники за кодирање на мултимедија, транспортни протоколи за мултимедија во безжични мрежи, контролни протоколи за мултимедија во безжични мрежи. Познавања за карактеристиките на мултимедискиот сообраќај. Поседување на знаење за практично обезбедување на QoS на мултимедиските апликации за безжичните мобилни уреди.",
                null),
                new Course(null,
                        "Вградливи микропроцесорски системи",
                        "Студентите ќе се стекнат со разбирање на хардверот, софтверот и состемскиот дизајн на вградените системи. Тие ќе ја разберат важноста на интеракцијата меѓу хардверот и софтверот и поврзувањата со сензори и актуатори. Ќе ги стекнат основите на програмирање на вградени системи. Студентите ќе бидат способни да ги дефинираат архитектуралните барања, вклучувајќи го и хардверот и софтверот потребен за да се изгради модерен вграен систем.",
                        null),
                new Course(null,
                        "Виртуелизација",
                        "Запознавање со виртуелизацијата како парадигма на креирање на виртуелни компјутерски системи преку софтверска виртуелизација на харверските компоненти. Обработка на различните аспекти на виртуелизацијата, технологиите и техниките вклучени во процесот, како и придобивките и губитоците кои се појавуваат во процесот на виртуелизација.",
                        null),
                new Course(null,
                        "Вовед во мрежна наука",
                        "Запознавање со основните концепти од мрежна наука со реални податоци. Оспособување на студентите за анализа на својствата и динамичките процеси во реалните комплексни мрежи и нивно моделирање и визуелизација. Изучување на основните методи за октривање на заедници, оценка на робустноста, оптимизација, податочно рударење и предвидување во комплексни мрежи.",
                        null),
                new Course(null,
                        "Географски информациски системи",
                        "Создавање и управување со просторни (Географски) информациони систем.",
                        null),
                new Course(null,
                        "Дигитална форензика",
                        "По завршување на курсот студентите ќе се стекнат со знаење за принципите и техниките потребни за една дигитална форензичка истрага. Студентите ќе се стекнат и со практично искуство за работа со различни форензички алатки за различни оперативни системи.",
                        null),
                new Course(null,
                        "Електронска и мобилна трговија",
                        "Студентот со завршување ќе се стекне со вештини за развој на апликации за е-трговија и м-трговија. Ќе се запознаат со платформите за е-трговија и ќе научат да ги користат и употребуваат истите за градба на електронски продавници.",
                        null),
                new Course(null,
                        "Континуирана интеграција и испорака",
                        "Запознавање со основните концепти на развој и операции (DevOps) преку континуирана интеграција, тестирање, испорака и распоредување на софтверски решенија и системи. Осознавање на различните перспективи на развојниот (Dev) и оперативниот (Ops) дел од животниот циклус на еден систем. Оспособување на студентите за употреба на алатки за автоматизација на процесите за интеграција, тестирање, испорака и распоредување. Запознавање со предизвиците и најдобрите практики за менаџирање со софтверски изданија и конфигурации.",
                        null),
                new Course(null,
                        "Машинско учење",
                        "Целта на курсот е студентите да се запознаат со основите на модерните техники\n" +
                                "од областа на машинско учење. По завршувањето на курсот кандидатите: ќе имаат\n" +
                                "продлабочени знаења за напредните технологии и методи за машинско учење; ќе\n" +
                                "можат да разберат, анализираат и формулираат генерални проблеми од областа на\n" +
                                "машинско учење; ќе можат успешно да применат алгоритми за машинско учење\n" +
                                "при решавање на реални проблеми; ќе можат да конципираат, анализираат,\n" +
                                "реализираат и проценат перформанси на систем за машинско учење.",
                        null),
                new Course(null,
                        "Мултимедиски системи",
                        "Запознавање на студентот со основните концепти за работа со мултимедиските податоци, начините на нивно моделирање и имплементирање и манипулација со истите. Студентот ќе биде способен да моделира мултимедиски податоци, ќе знае практично да го применува содржински-базираното пребарување на мултимедиските податоци, и ќе се здобие со воведни знаења за креирање на апликации базирани на мултимедиските содржини.",
                        null),
                new Course(null,
                        "Паралелно програмирање",
                        "Истражување на алгоритмите и техниките за програмирање на најновите\n" +
                                "паралелни платформи со споделена меморија и со дистрибуирана меморија.\n" +
                                "Студентот ќе се запознае со теоретските и практичните (програмските)\n" +
                                "компоненти.",
                        null),
                new Course(null,
                        "Податочно рударство",
                        "Запознавање со методи за идентификација на валидни, нови, корисни и\n" +
                                "разбирливи шеми во податоци и откривања на нови знаења. Претпроцесирање на\n" +
                                "податоците. Вовед во предиктивни модели од податоците: класификација,\n" +
                                "регресија, оценка на веројатноста. Откривање на кластери и правила на\n" +
                                "асоцијација.",
                        null),
                new Course(null,
                        "Процесирање на сигналите",
                        "Познавањето на основите и техниките на дигиталното процесирање на сигнали е\n" +
                                "важно за секој инженер кој работи на апликации каде што има процесирање на\n" +
                                "сигнали. Со курсот студентите се воведуваат во теоретските основи дигитално\n" +
                                "процесирање на сигнали кои вклучуваат дискретизација, Фуриеова и z –\n" +
                                "трансформација. Студентите ќе стекнат и познавања од основните алатки како\n" +
                                "што се дигиталните IIR и FIR филтри. Во курсот ќе бидат дадени и основите на\n" +
                                "теоријата на управување. Преку бројните примери и вежби студентите ќе научат и\n" +
                                "практично да користат готови алатки за процесирање на сигнали.",
                        null),
                new Course(null,
                        "Сервисно ориентирани архитектури",
                        "Предметот сервисно-ориентирани архитектури има за цел да ги запознае студентите со организација, дизајн и развој на на дистрибуираните системи базирани на сервиси. Сервисно-ориентираните архитектури опфаќа теми од софтверско и системско инженерство. Од аспект на софтверско инженерство студентите ќе се запознаат со процесот на анализа и дизајн при развој на сервисно-ориентирани апликации, како и со организацијата на процесот на развој на софвер погодни за сервисно-ориентирани системи. Во поглед на системско инженерство, предметот ќе го покрие целосниот екосистем на сервисно-ориентирана и микро-сервисно ориентирана архитектура, нејзините компоненти, поврзаност, соработка и координација.",
                        null),
                new Course(null,
                        "Софтверски дефинирана безбедност",
                        "Разбирање и примена на клучните концепти од развој на безбеден софтвер во поглед на податоци, автентикација, авторизација и безбедни веб апликации.",
                        null),
                new Course(null,
                        "Статистичко моделирање",
                        "Студентите да научат да направат правилна и осмислена статистичка анализа на\n" +
                                "податоци со користење на класичен и Баесов пристап. Да постават соодветни\n" +
                                "статистички модели, да ги проверат и протолкуваат добиените резултати.\n" +
                                "Акцентот е ставен на користење софтвер со отворен код (R, Python,..) за градење\n" +
                                "на моделите над реални примери со користење на непходните теориски резултати.\n" +
                                "Курсот треба да е поготовка на студентите за останатите во кои се анализираат\n" +
                                "податоци од различни истражувања.",
                        null),
                new Course(null,
                        "Формални јазици и автомати",
                        "Оспособеност за користење на формалните модели на пресметливост како основа за\n" +
                                "теорија и пракса на програрамските јазици, компајлери, како и за пратење на повисок\n" +
                                "курс од теоријата на пресметливоста. Запознавање со јазици, регуларни и контекстно\n" +
                                "слободни јазици, конечни автомати и push down автомати, граматики и врската меѓу\n" +
                                "определен вид на автомати и јазици.",
                        null),
                new Course(null,
                        "Автономна роботика",
                        "По завршувањето на овој предмет, студентот се очекува да има продлабочено\n" +
                                "знаење за развој на автономни роботски системи (автономни возила, автономни\n" +
                                "летала и сл.) со користење на веројатностните пристапи во роботиката.",
                        null),
                new Course(null,
                        "Администрација на бази на податоци",
                        "Предметот ќе се фокусира на state-of-the-art технологиите поврзани со имплементација на базите на податоци. Технологиите и техниките кои се користат за имплементација на базите на податоци ќе бидат обработени како од кориснички, така и од системски аспект. Од аспект на системско инжинерство, предметот ќе навлезе во концептите и алгоритмите за: процесирање на трансакции, контрола на истовремено извршување, репрезентација на лог и метадата, безбедносни политики кај базите, техники за репликација и дистрибуција, бекап и реставрација.",
                        null),
                new Course(null,
                        "Анализа и дизајн на ИС",
                        "Запознавање на студенти со актуелните техники за анализа и дизајн на информациските системи (ИС). Навлегување во студија на случај на развој на ИС со користење на актуелни методологии. Оспособување за практична анализа на кориснички побарувања и креирање ефективни модели во сите фази развој на еден ИС , со нагласок на фазите на анализа и дизајн. По завршување на курсот се очекува студентот да демонстрира знаење за користење на современи пристапи во процесот на анализа и дизајн на информациските системи.",
                        null),
                new Course(null,
                        "Веб базирани системи",
                        "Запознавање и користење на технологиите на семантички веб и поврзани податоци. Студентите ќе научат да развиваат интелигентни апликации базирани на поврзани податоци и да пронаоѓаат и користат отворени податочни множества.",
                        null),
                new Course(null,
                        "Вовед во биоинформатиката",
                        "Студентите да се запознаат со областите и проблемите кои ги покрива биоинформатиката, да бидат во можност да вршат генска и протеинска секвенцна анализа, да користат биолошки бази податоци, да ги запознаат пресметковните методи за решавање проблеми во молекуларната биологија.",
                        null),
                new Course(null,
                        "Вовед во паметни градови",
                        "Да го запознае студентот со главните концепти, теми и трендови на паметните и одржливите градови, улогата на информациите во дизајнот на мрежните ресурси и влијанието врз урбаниот дизајн, развојот и урбаното живеење.",
                        null),
                new Course(null,
                        "Вовед во препознавање на облици",
                        "Целта на курсот е студентите да ги научат главните концепти на методите и\n" +
                                "техниките кои се применуваат за препознавање на облици.По завршувањето на\n" +
                                "курсот кандидатитеќе бидат оспособени за дизајнирање, реализирање и\n" +
                                "имплементација на системи за автоматско препознавање на облици, проценка на\n" +
                                "нивните перформанси и нивна оптимизација.",
                        null),
                new Course(null,
                        "Дигитална постпродукција",
                        "По завршување на курсот се очекува студентите да се оспособени за основни методи за дигитална постпродукција, дигитално композитирање, работа со секвенци од слики, интеграција на дигитални објекти во слики и следење и спарување на движења од различни извори",
                        null),
                new Course(null,
                        "Имплементација на системи со слободен и отворен код",
                        "По завршување на курсот се очекува студентите да се оспособени за продуктивно учество во поголеми софтверски тимови кои работат употребувајќи технологии со слободен и отворен код. Да бидат способни за работа во програмски јазици со отворен код, да развиваат веб апликации на тие платформи. Да бидат способни да водат софтверски проект базиран на технологии со слободен и отворен код.",
                        null),
                new Course(null,
                        "Иновации во ИКТ",
                        "Разбирање на иновативноста. Стекнување на иновативни вештини. Примена на ИКТ за креирање на иновации. Креирање на иновации во ИКТ.",
                        null),
                new Course(null,
                        "Интернет на нештата",
                        "Студентот ќе биде запознаен со главните развојни чекори и предизвици при дизајнирање на решенија базирани на Интернет на нештата. Студентот ќе може да моделира, дизајнира и имплементира вакви системи во различни апликативни домени.",
                        null),
                new Course(null,
                        "Машинска визија",
                        "Да се воведат студентите во основните концепти и техники во компјутерската визија. Студентите кои успешно ќе го завршат курсот ќе бидат способни за дизајнирање на ефикасни системи за компјутерска визија како: препознавање на ракопис, детекција и препознавање на лица, проценка на движење, следење на луѓе и возила, препознавање на гестови, препознавање и класификација на визуелни објекти, разбирање и анализа на сцени итн",
                        null),
                new Course(null,
                        "Менаџмент информациски системи",
                        "По завршување на курсот студентите ќе имаат познавање од видови и примена на\n" +
                                "менаџмент информациски системи",
                        null),
                new Course(null,
                        "Методологија на истражувањето во ИКТ",
                        "Целта на курсот е студентите да се запознаат со основите на методологиите на истражување во ИКТ. По завршувањето на курсот кандидатите ќе имаат продлабочени знаења за методологиите на истражувања во ИКТ, ќе можат да конципираат и спроведат научно истражување, и да напишат извештај од научно истражувачката работа.",
                        null),
                new Course(null,
                        "Мобилни информациски системи",
                        "По завршувањето на предметот се очекува студентот да има продлабочено знаење во примена на технологиите и алатките за складирање, прибирање и обработка на податоци во дистрибуирана и сеприсутна околина со користење на различни мобилни платформи.",
                        null),
                new Course(null,
                        "Мобилни платформи и програмирање",
                        "Целта на предметот е студентите да се запознаат со современите мобилни\n" +
                                "платформи и да научат да програмираат и развиваат мобилни апликации. Ќе научат да се справуваат со ограничувањата од мобилните уреди и да развиваат ефикасни програми. Изработените апликации ќе научат да ги публикуваат на маркет и да го следат користењето на истите",
                        null),
                new Course(null,
                        "Напредна интеракција човек компјутер",
                        "Овој предмет ги запознава студентите со основите на комплексната интеракција која се одвива меѓу човекот и компјутерот. Студентите се запознаваат и со техниките за моделирање на корисници, проблеми, апликации и средини (амбиенти) како и на техники за евалуација и анализа на интелигентни интефејси. Се разгледуваат принципи за градење посредници кои ги опфаќаат ограничувањата и во двете примарно афектирани групи: човекот и компјутерот. Студентите треба да научат дека корисникот е еден од главните елементи при креирање на компјутерските системи. При тоа, се дава увид во начинот за развивање на хардверот и софтверот за различни групи на корисници, како и за специфични апликациски домени. Студентите стекнуваат познавања на принципи за проектирање на кориснички интерфејси адаптибилни на околината, интелигентни кориснички интерфејси базирани на агенти и интерфејси чувствителни на контекст, како и интелигентни решенија наменети за специфични типови на кориснички групи.",
                        null),
                new Course(null,
                        "Обработка на природните јазици",
                        "Целта на предметот е студентитеда се стекнат со основните теоретски и практични\n" +
                                "знаења за алгоритмите за обработка на природните јазици. Ќе стекнат знаења за тоа\n" +
                                "како јазичната структура и значење се репрезентираат во структури наподатоци, како\n" +
                                "овие структури и значење да се препознаат во текстуалниподатоци, и најбитно, како\n" +
                                "да изградат алгоритми кои ќе ги препознаваатвистинските одговори помеѓу големиот\n" +
                                "број опции.",
                        null),
                new Course(null,
                        "Операциони истражувања",
                        "Да го запознае студентот со областа на проблеми и методи на операциони\n" +
                                "истражувања, проблеми на оптимизација на ресурси и проекти и оптимално\n" +
                                "управување, со методи и техники на линеарно и нелинеарно програмирање,\n" +
                                "теории на одлучување и игри, операциони истражувања поврзани со управувaчки\n" +
                                "информациски системи и информациски системи за подршка на одлучување и\n" +
                                "предвидување.",
                        null),
                new Course(null,
                        "Пресметување во облак",
                        "Овој предмет ќе го оспособи студентот со основни познавања за концептот на облак и услуги во облак.",
                        null),
                new Course(null,
                        "Програмирање на видео игри",
                        "Целта на предметот е да ги запознае студентите со процесот на програмирање на\n" +
                                "видео игри. За таа цел студентите ќе бидат запознаени со основните компоненти\n" +
                                "на една видео игра и начинот на кој истите се програмираат. По завршување на\n" +
                                "курсот се очекува кандидатот да ги разбира концептите за програмирање на видео\n" +
                                "игри и да може да реализира програмски самостојно или во тим едноставна видео\n" +
                                "игра.",
                        null),
                new Course(null,
                        "Програмски парадигми",
                        "Целта на овој курс е запознавање на студентите со програмски парадигми\n" +
                                "различни од императивната и објектно-ориентираната, со фокус на\n" +
                                "декларативната и функционалната програмска парадигма. По завршувањето на\n" +
                                "курсот студентите треба да бидат способни да: Споредуваат различни програмски\n" +
                                "парадигми и да изберат соодветна за даден проблем, Користат логички\n" +
                                "програмски јазик за имплементација на ефикасни алгоритми, Користат логички\n" +
                                "програмски јазик за репрезентација и манипулација со знаење, Користат\n" +
                                "функционален програмски јазик за пишување на програми без странични ефекти,\n" +
                                "Разбираат и користат функции од прв и повисок ред, функционални затворања,\n" +
                                "мрзлива евалуација и апстракција на секвенци, Разбираат и пишуваат едноставни\n" +
                                "конкурентни програми",
                        null),
                new Course(null,
                        "Рударење на масивни податоци",
                        "Студентите да се запознаат со алгоритмите и техниките на податочно рударење и\n" +
                                "машинско учење за анализа на многу големи податочни множества. Фокус ќе биде\n" +
                                "даден на дистрибуираните платформи како и на начинот на дефинирање и креирање\n" +
                                "на алгоритми за процесирање и анализа на многу големи податочни множества.",
                        null),
                new Course(null,
                        "Системи за поддршка при одлучувањето",
                        "Овој курс претставува вовед во примена на анализа на податоци за донесување\n" +
                                "деловни одлуки. Целта на курсот е студентите да се запознаат со методите,\n" +
                                "техниките и системите за поддршка при одлучувањето, како и анализа на\n" +
                                "одлуките. Да се запознаат со техниките за стекнување на знаење и репрезентација\n" +
                                "на знаење. По завршување на курсот студентите ќе стекнат знаење како да ги\n" +
                                "користат системите за поддршка при одлучувањето, правилно да изберат\n" +
                                "соодветен систем за поддршка при одлучувањето во даден бизнис контекст, како и\n" +
                                "да дизајнираат, развијат и менаџираат системи за поддршка при одлучувањето.",
                        null),
                new Course(null,
                        "Софтвер за вградливи системи",
                        "Целта на курсот е да ги оспособи студентите да креираат апликации наменети за\n" +
                                "микроконтролери како и работа со влез/излез. Студентите ќе можат да\n" +
                                "имплементираат и управување со софтверска конфигурација.",
                        null),
                new Course(null,
                        "Софтверски дефинирани мрежи",
                        "По завршувањето на курсот се очекува студентот да има познавање на архитектурата на софтверски дефинираните мрежи и мрежите со виртуелизирани мрежни функции.. Да ги знае начините за софтверски пристап до мрежите, технологиите за конвергирани мрежи и одвојување на корисничкaта од контролната рамнина, како и хардверот од софтверот.",
                        null),
                new Course(null,
                        "Социјални мрежи и медиуми",
                        "Разбирање на основните концепти за анализата на социјалните мрежи. Примена на овие методи преку взаемна колаборација меѓу студентите. Да се разбере врската помеѓу квалитативните и квантитативните методи за анализа на социјалната мрежа Да се разбере како овие општествени технологии влијаат на општеството и обратно",
                        null),
                new Course(null,
                        "Управување со ИКТ проекти",
                        "По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките и методите за управување со ИКТ проекти, да има продлабочено знаење во утврдување софтверски и системски барања, познавање на метриките за следење на проекти и евалуација, да има знаење да примени техники за управување со барањата на разни проектни интересни групи, знаење за примена на тенхики за анализа на трошоци, знаење за изготвување на извештаи, познавање на практични софтверски алатки за управување со проектен циклус.",
                        null),
                new Course(null,
                        "Биолошки инспирирано пресметување",
                        "Целта на овој курс е запознавање на студентите со алгоритми кои се инспирирани\n" +
                                "од феномени кои се појавуваат во природата и примена на истите за решавање на\n" +
                                "проблеми од оптимизација, дизајн и учење. Фокусот ќе биде поставен врз\n" +
                                "абстракцијата на алгоритмите од воочените феномени, анализа на нивниот\n" +
                                "резултат како и нивна споредба. Во текот на курсот ќе се посвети внимание на\n" +
                                "конкретни примени на споменатите алгоритми. По завршувањето на курсот се\n" +
                                "очекува студентите да се здобијат со: - Знаење за природните феномени кои се\n" +
                                "инспирација за дискутираните алгоритми - Разбирање за силните и слабите страни\n" +
                                "на алгоритмите - Способност за идентификување на соодветноста на алгоритмите\n" +
                                "и нивна примена во проблеми од оптимизација, дизајн и учење",
                        null),
                new Course(null,
                        "Блоковски вериги и криптовалути",
                        "Целта на овој курс е да овозможи на слушателите да разберат како фунцкционираат крипто валутите, и идејата, технологиите и организациите кои ги поддржуваат или произлегуваат од нив.",
                        null),
                new Course(null,
                        "Веб пребарувачки системи",
                        "Запознавање со концепти за развој на веб пребарувачките системи. Разбирање на начините на обработување на прашањата и множеството на документи низ кои се пребарува, како и начини за автоматско собирање податоци од веб. По завршувањето на курсот се очекува студентот да демонстрира познавање на методи за процесирање на прашања, репрезентација на документите и нивно индексирање и класификацирање, да демонстрира познавање на методи за пребарување и индексирање на слики и да може самостојно да развива алгоритми за пребарување со користење на програмски алатки",
                        null),
                new Course(null,
                        "Виртуелна реалност",
                        "Предметот треба да овозможи запознавање на студентите со концептот на виртуелна реалност, различните видови виртуелни околини, влезно-излезните уреди, како и основни програмерски техники за дизајнирање и развој на виртуелни околини. По завршување на курсот се очекува студентот да го разбира концептот на виртуелната реалност, да биде во можност да ги опише карактеристиките на различните видови виртуелни околини и да има основни познавања за дизајнирање и развој на виртуелни светови.",
                        null),
                new Course(null,
                        "Вовед во когнитивни науки",
                        "Целта е да се разбере како работи човечкиот мозок. Студентите ќе се запознаат со теоретските и емпириските погледи кои ја дефинираат когнитивната наука. Ќе се запознаат со истражувањата за природата на менталните процеси како перцепцијата, мислењето, меморијата, фантазијата, вниманието, јазикот, интелигенцијата, донесувањето одлуки и решавањето проблеми. Студентите ќе научат кои се алатките превземени од експерименталната психологија, наука на развојот, комјутерската наука, лингвистика, визуализацијата, филозофијата, антропологијата, бихевиоризмот, неврологијата. Курсот ќе ги поврзе сите овие пристапи кои се поврзуваат во когнитивната наука.",
                        null),
                new Course(null,
                        "ИКТ за развој",
                        "Целта на курсот е да ги разгледа основите принципи и најдобри практики за\n" +
                                "развој и за трансфер на технологии. Да се разбере концептот на одржлив развој кој\n" +
                                "ги го вклучува влијанието врз природата и општеството. Да се разберат 17-те\n" +
                                "дефинирани цели за одржлив развој од страна на Обединетите Нации и да се\n" +
                                "дефинираат начини на нивно исполнување. Разбирање на можностите за примена\n" +
                                "на нови технологии како мобилни уреди, дронови, сензори во областите како\n" +
                                "земјоделието, комуникациите, едукацијата, економијата, здравството, владите и\n" +
                                "половата еднаквост. Разбирање на поимите за социјални иновации и социјално\n" +
                                "претприемништво. Примена на методологии за дизајнирање на решенија кои се\n" +
                                "насочени кој човекот. Разбирање на методологијата на размесување за дизајн.",
                        null),
                new Course(null,
                        "Интелигентни информациски системи",
                        "По завршување на предметот, студентот ќе биде оспособен за создавање и\n" +
                                "управување со интелигентни информациски системи. Студентот ќе поседува\n" +
                                "познавања од веб рударење, сентимент анализа, системи за препораки,\n" +
                                "персонализација и профилирање на корисници.",
                        null),
                new Course(null,
                        "Интелигентни системи",
                        "Целта на предметот е да го заокружи знаењето на студентите од областа на интелигентните системи, почнувајќи од претпроцесирањена податоците до валидирање на изградениот систем. Студентите ќе се оспособат да изградат интелигентен систем од почеток до крај на реални проблеми од специфичен домен.",
                        null),
                new Course(null,
                        "Компјутерска анимација",
                        "По завршување на курсот се очекува студентите да се оспособени за основни методи за продуктивно создавање на компјутерски базирани анимации, за работа во апликации за создавање анимации и можат самостојно да моделираат, текстурираат, ригуваат, осветлуваат, анимираат, рендерираат и композитираат дигитални сцени.",
                        null),
                new Course(null,
                        "Мобилни апликации",
                        "По завршувањето на предметот се очекува студентот да има продлабочено знаење во примена на технологиите и алатките за дизајн и развој на мобилни апликации.",
                        null),
                new Course(null,
                        "Моделирање и менаџирање на бизнис процеси",
                        "По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење за типови бизнис процеси и нивна поврзаност со ИС, ќе имаат продлабочено знаење во идентификување, моделирање и мапирање разни типови бизнис процеси, ќе знаат да применат алатки и јазици за моделирање на бизнис процеси преку соодветни дијаграми, ќе имаат познавање од принципите за подобрување на тек на процеси, ќе имаат познавање од концептите за податочна размена и интероперабилност.",
                        null),
                new Course(null,
                        "Модерни трендови во роботика",
                        "Студентите ќе бидат воведени во модерните трендови во роботиката. Ќе бидат запознаени со современите техники на моделирање на околината, во која роботите стануваат секојдневие. Студентите ќе се стекнат со познавање на тековните трендови во роботиката како што се интеракција човек – робот, нанороботика, биолошки роботи на генетско ниво, роботизирани производни процеси, роботика како асистивна технологија и други трендови",
                        null),
                new Course(null,
                        "Напредни бази на податоци",
                        "Запознавање на студентите со напредните концепти на релационите бази на податоци, неопходни за моделирање, креирање, управување и одржување на базите на податоци, како и за развој на податочно интензивни информациски системи. Со тоа студентите ќе се стекант со длабоки теоретски и практични знаења од областа на базите на податоци. Исто така, студентите ќе се запознат со современите текови на развој и проширување на традиционалните системи за управување на бази на податоци, а со цел да одговорат на актуелните предизвици во развојот на информатичката теорија и практика.",
                        null),
                new Course(null,
                        "Неструктурирани бази на податоци",
                        "Целта на курсот е студентите да се запознаат со неструктурираните и полуструктурираните типови на податоци, нивната организација и чување, како и техниките за манипулација и обработка на истите. Исто така студентите ќе бидат запознаени и со NoSQL базите на податоци, современи бази на податоци кои не подлежат на релациониот модел, а се користат во дистрибуирани и кластер околини. Посебен акцент ќе биде ставен на практичното знаење на некоја од NoSQL базите на податоци.",
                        null),
                new Course(null,
                        "Претприемништво",
                        "Студентите ќе бидат запознаени со предизвиците со кои ќе се соочат доколку се решат да започнат сопствен бизнис. Тие ќе можат да изработат иницијално истражување на пазарот, да ги дефинираат метриките со кои ќе ја следат успеноста на својот бизнис, како и да знаат како да препознаат дали обезбедиле вредност за своите клиенти. Конечно, тие ќе бидат оспособени да се претстават пред потенцијални клиенти, партнери и инвеститори.",
                        null),
                new Course(null,
                        "Складови на податоци и аналитичка обработка",
                        "Запознавање со oрганизацијата и манипулацијата со податоците организирани во складови на податоци, како и основните операции и алгоритми за работа со складови на податоци. Студентот ќе биде оспособен за моделирање на складови на податоци, организација и манипулација со податоците сместени во складови на податоци, изготвување на аналитички извештаи базирани на истите податоци",
                        null),
                new Course(null,
                        "Бизнис статистика",
                        "Запознавање со основните статистички методи и техники за прикажување, анализа и истражување на податоци.",
                        null),
                new Course(null,
                        "Основи на теоријата на информации",
                        "Студентите ќе бидат запознати со основите на теорија на веројатност, а потоа и основните поими од теорија на информации и нејзината примена во реални комуникациски системи.",
                        null),
                new Course(null,
                        "Основи на комуникациски системи",
                        "Главна цел на предметот е студентите да се запознаат со анализата на комуникациски сигнали и нивниот пренос низ медиум, типовите на модулација и влијанието на шумот врз модулациските техники. Дополнително студентите ќе се здобијат со познавање од софтверски дефинирано радио, современите комуникациски системи и нивниот тековен развој.",
                        null),
                new Course(null,
                        "Одржливи и енергетски ефикасни компјутерски системи",
                        "Студентите ќе стекнат знаење за мерење и пресметување компјутерска моќност и системи за ладење, дизајн на енергетско ефикасни компјутерски системи, процеси, компоненти во насока на ниска потрошувачка на енергија, дизајн на енергетско ефикасни електрични кола, дизајн на енергетски ефикасни компјутерски системи со минимум број на хардверски компоненти, дизајн на еко дата центри, рециклирање на компјутерска опрема, користење на виртиуелизација и интернет решенија во намалување на бројот на протребата од други компјутерски системи, користење на техники за планирање и развој на еко компјутерски технолошки решенија, еко-компјутерски стандарди и регулативи (EnergyStar, RoHS и други), штетно влијание на средината и рециклирање, бизнис процеси за одржлив компјутерски развој на компаниите и други зелени компјутерски технологии, зголемување на еко-свесноста со користење на еко-компјутерски решенија, рециклирање на компјутески компоненти и конструкција на одржливи компјутерски системи, одржливи компјутерски системи за мониторинг анализа во реално време, е-принт во компании, зголемување на бизнис вредноста на компаниите со користење на одржливи и ефикасни компјутерски системи.",
                        null),
                new Course(null,
                        "Мрежна безбедност",
                        "Целта на овој курсот е да се покријат принципите за сигурноста кај компјутерските системи и мрежи, при што студентот ќе се запознае со различни техники за напад и одбрана.",
                        null),
                new Course(null,
                        "Паралелно и дистрибуирано процесирање",
                        "Цел на предметот е студентите да ги совладаат методите на паралелно и дистрибуирано процесирање, можностите за паралелизација на секвенцијална програма, дистрибуирано процесирање на голем број на податоци и проблемите со кои треба да се справат во тој процес",
                        null),
                new Course(null,
                        "Администрација на мрежи",
                        "По завршувањето на курсот се очекува студентот да ги разбира проблемите на администрацијата со мрежи и да знае да ги применува на методите и алатките за администрација со комуникациски мрежи.",
                        null),
                new Course(null,
                        "Инфраструктурно програмирање",
                        "Студентот ќе се здобие со знаење за лесно и ефикасно менаџирање на IT системи, управување со традиционалните податочни центри, приватни и јавни облаци и клиентските компјутери и уреди. Студентот ќе може да се запознае и со платформи за менаџирање на повеќе хипервизори, физички ресурси и апликации.",
                        null),
                new Course(null,
                        "Криптографија",
                        "Запознавање со основните криптографски принципи и методи; изучување на основните крипто- дизајни; практично користење на изучените криптографски алгоритми.",
                        null),
                new Course(null,
                        "Дистрибуирани системи",
                        "Предметот има за цел запознавање со развојот на middleware системите. Предмеот ги покрива принципите врз кои се изградени дистрибуираните системи, пред се комуникациите, процесирањето, именување, конзистентност и репликација, справувње со дефекти и безбедност. Овие принципи се понатаму обработени во нивната примена кај дистрибуираните веб базирани системи, дистрибуираните објектно базирани системи, дистрибуираните датотечни системи и дистрибуираните коориднациски системи.",
                        null),
                new Course(null,
                        "Оптички мрежи",
                        "Студентот ќе се стекне со основни познавања за дизајн, контрола и управување на оптички мрежи со помош на современите мрежни технологии, како и со некои тековни развои во областа.",
                        null),
                new Course(null,
                        "Етичко хакирање",
                        "Студентот ќе ги запознае основните концепти, техники и алатки кои се користат во полето на безбедност на системи. Со преземање на улогата на \"напаѓач\" студентот ќе се стекне со знаење за повеќето сигурносни слабости во неговата околина и начин како да се заштити од нив.",
                        null),
                new Course(null,
                        "Дискретни структури 1",
                        "Во овој предмет ќе се изучуваат базични математички концепти за компјутерски\n" +
                                "науки. Студентите ќе се запознаат со основите на множества, исказна и предикатна\n" +
                                "логика, техники за докажување и булова алгебра.",
                        null),
                new Course(null,
                        "Дискретни структури 2",
                        "Курсот претставува вовед во основните математички концепти неопходни за\n" +
                                "повисоките курсеви од компјутерски науки. Ќе се изучуваат напредни техники за\n" +
                                "докажување, индукција рекурзија. Студентите треба да стекнат вештини за решавање\n" +
                                "на комбинаторни задачи. Да се запознаат со основната терминологија и основите за\n" +
                                "претставување на графови.",
                        null),
                new Course(null,
                        "Мерење и анализа на интернет сообраќај",
                        "Цели на предметната програма (компетенции): За инженер кој работи со мрежни технологии е корисно да има познавања од мерење, анализа и моделирање на интернет сообраќајот заради поквалитетно дизајнирање на мрежите како и подобро користење на нивните перформанси. Со овој курс студентите ќе се запознаат со основите на инженерството на комуникациски сообраќај, како и различни техники за анализа, мерење, карактеризација, класификација и предвидување на интернет сообраќај.",
                        null),
                new Course(null,
                        "Процесна роботика",
                        "По завршувањето на предметот студентот се очекува да има основни познавања\n" +
                                "од водењето на процесите во роботиката, развој на апликации со сензори и\n" +
                                "актуатори и управување со процеси кои вклучуваат роботи. Студентите ќе се\n" +
                                "воведат во начините како се програмираат индустриски контролери.",
                        null),
                new Course(null,
                        "Вовед во анализа на временските серии",
                        "Запознавање на студентите со анализа на произволни временски серии. Курсот два\n" +
                                "вовед во типовите на временски серии, покрива стационарни процеси, спектрална\n" +
                                "анализа на стационарни процеси, ARMA модели, ARIMA и сезонални ARIMA\n" +
                                "модели, временско-просторни методи. Со знаењето стекнато на курсот студентите ќе\n" +
                                "може да анализираат временски серии од берзански податоци, да откриваат\n" +
                                "трендови, да предвидуваат идни појави, како и да ги користат за препознавање на\n" +
                                "разновидни настани кои се опишани со временски серии.",
                        null),
                new Course(null,
                        "Моделирање и симулација",
                        "Студентот ќе се здобие со знаења за користење на техники за моделирање со цел\n" +
                                "да го евалуира однесувањето на реалните системи. Студентот ќе стекне\n" +
                                "способност за конструирање, верификација и решавање на модели со различни\n" +
                                "нивоа на апстракција и деталност. Ќе бидат опфатени и методи за фитување на\n" +
                                "состојбата и параметрите на моделите со реални податоци, како и предвидување\n" +
                                "на идното однесување и \"што-ако\" анализи.",
                        null),
                new Course(null,
                        "Пресметковна биологија",
                        "Целта на курсот е студентите да се запознаат со основите на модерните техники од\n" +
                                "областа на пресметковна биологија. По завршувањето на курсот кандидатите: ќе\n" +
                                "имаат продлабочени знаења за напредните технологии и методи за пресметковна\n" +
                                "биологија, динамички системи и моделирање; ќе можат да разберат, анализираат и\n" +
                                "формулираат генерални проблеми од областа на пресметковна биологија; ќе можат\n" +
                                "успешно да применат методи при решавање на реални проблеми; ќе можат да\n" +
                                "конципираат, анализираат, реализираат и проценат перформанси на методи и модели\n" +
                                "во пресметковна биологија.",
                        null),
                new Course(null,
                        "Програмски јазици и компајлери",
                        "Студентите треба да го разбрерат развојот и спектарот на програмските јазици, и да\n" +
                                "го сфатат процесот на конструкција на компајлер што ќе ги надгради како\n" +
                                "програмери кои навлегле во суштината на програмските јазици.",
                        null),
                new Course(null,
                        "Споделување и пресметување во толпа",
                        "Целта на предметот е да ги запознае студентите со можностите на толпата да споделува и обработува податоци кои овозможуваат да се решаваат проблеми кои се сеуште комплексни за компјутерските системи, но многу едноставни за колектив со човечка интелигенција. Предметот ќе ги воведе студентите во нов дизајн на апликации и концепт на програмирање кој се заснова на недоверливо учество на голем број поединци од толпата. Во предметот ќе се разгледаат постоечки апликации и платформи за собирање на податоци и решавање на обемни задачи на барање.",
                        null),
                new Course(null,
                        "ИТ системи за учење",
                        "Цели на предметната програма (компетенции): По успешното завршување на овој предмет, студентот ќе биде запознат со еволуцијата на теориите за учење и ќе биде во состојба да ги разбере улогата и новите трендови кај е-околините за учење и да го разбере преминот од традиционалните во е-околините за учење. Студентите ќе се стекнат со способност да понудат соодветни постојни системи за менаџмент со учење и наставни содржини и системи за проверка на знаење на бизнис побарувања, како и да креираат нови иновативни решенија во областа на е-учењето.",
                        null),
                new Course(null,
                        "Дигитизација",
                        "Целта на предметот е да се научат процесот и техниките за дигитизација.\n" +
                                "Студентите треба да ги совладаат основните принципи за менаџирање со\n" +
                                "дигитални материјали и нивна презервација, како и техники и технологии за\n" +
                                "нивно презентрање.",
                        null)
        );
        if (!courseRepository.existsByTitle("Бизнис и менаџмент"))
        {
            courseRepository.saveAll(courses);
        }
    }

}
